#+AUTHOR: Einar Elén
#+EMAIL: einar.elen@gmail.com
#+OPTIONS: toc:3 html5-fancy:t org-html-preamble:nil
#+HTML_DOCTYPE_HTML5: t
#+PROPERTY: header-args :tangle yes :noweb yes :comments both
#+STARTUP: noinlineimages
** Applications 
#+NAME: general-applications
#+BEGIN_SRC emacs-lisp :tangle no 
  (elib-user-leader-def
    "a" '(nil :wk "Applications")
    "ac" '(calc-dispatch :wk "Calc Dispatch")
    "ad" '(dired :wk "Dired")
    "aP" '(nil :wk "Processes")
    "aPp" '(proced :wk "Proced")
    "aPl" '(list-processes :wk "List Processes")
    "alp" '(package-list-packages :wk "List packages")
    "am" '(nil :wk "Mu4e")
    "amm" '(mu4e :wk "Mu4e")
    "amc" '(mu4e-compose-new :wk "Compose")
    "at" '(twit :wk "Twitter")
    )

  (elib-user-leader-def
    "as" '(nil :wk "Shells")
    "'" '(spacemacs/default-pop-shell :wk "Shell")
    "ase" '(spacemacs/shell-pop-eshell :wk "Eshell")
    "ass" '(spacemacs/shell-pop-shell :wk "Shell")
    "asm" '(spacemacs/shell-pop-multi-term :wk "Multi term")
    "ast" '(spacemacs/shell-pop-ansi-term :wk "Ansi-term")
    "asT" '(spacemacs/shell-pop-term :wk "Term")
    )
    ;; (spacemacs/set-leader-keys
	  ;;   "'"   'spacemacs/default-pop-shell
	  ;;   "ase" 'spacemacs/shell-pop-eshell
	  ;;   "asi" 'spacemacs/shell-pop-shell
	  ;;   "asm" 'spacemacs/shell-pop-multiterm
	  ;;   "ast" 'spacemacs/shell-pop-ansi-term
	  ;;   "asT" 'spacemacs/shell-pop-term)
  (elib-user-leader-def
      "ao" '(nil :wk "Org")

    "aoc" '(nil :wk "Capture and Calendar")
    "aocs" '(org-caldav-sync :wk "Sync Calendar")
    "aoco" '(elib-open-calendar :wk "Calendar")
    "aocc" '(org-capture :wk "Capture")
    "aoa" '(org-agenda :wk "Agenda")
    "aos" '(org-store-link :wk "Store Link")
    )
  (elib-user-leader-def
    "aob" '(nil :wk "Brain")
    "aobv" '(org-brain-visualize :wk "Visualize")
    "aobc" '(org-brain-add-child :wk "Add Child")
    "aobf" '(org-brain-add-friend :wk "Add Friend")
    "aobp" '(org-brain-add-parent :wk "Add Parent")
    "aobl" '(org-brain-add-resource-link :wk "Add Link/Resource")
    "aobl" '(org-brain-delete-entry :wk "Delete Entry"))
  (elib-user-leader-def
   "aor" '(nil :wk "Org-ref")
   "aorl" '(nil :wk "Lookup")
   "aorla" '(arxiv-get-pdf-add-bibtex-entry :wk "Arxiv Get Bibtex and Pdf")
   "aorld" '(doi-utils-add-bibtex-entry-from-doi :wk "DOI Get Bibtex")
   "aorli" '(isbn-to-bibtex :wk "ISBN Get Bibtex")
   "aor." '(org-ref-bibtex-hydra/body :wk "Transient")
   "aori" '(nil :wk "Insert")
   "aoril" '(org-ref-helm-insert-label-link :wk "Label")
   "aorir" '(org-ref-helm-insert-ref-link :wk "Ref")
   "aoric" '(org-ref-helm-insert-cite-link :wk "Cite")
   "aorib" '(org-ref-insert-bibliography-link  :wk "Bibliography")
   "aoris" '(org-ref-insert-bibliographystyle-link  :wk "Bibliography Style")
   "aorif" '(org-footnote-action :wk "Footnote")
   "aoriC" '(doi-utils-add-entry-from-crossref-query :wk "Crossref")
   )





  (unbind-key "<f12>")
  (unbind-key "<f6>")
  (unbind-key "<f8>")
  (unbind-key "<f7>")
#+END_SRC

#+RESULTS: general-applications
| (C-s . helm-swoop-map)          | helm-next-line                         | undefined                |
| (C-r . helm-swoop-map)          | helm-previous-line                     | nil                      |
| (s . mu4e-view-mode-map)        | helm-mu                                | helm-mu                  |
| (c . mu4e-headers-mode-map)     | helm-mu-contacts                       | helm-mu-contacts         |
| (s . mu4e-headers-mode-map)     | helm-mu                                | helm-mu                  |
| (C-M-c . mu4e-org-mode-map)     | helm-mu-contacts                       | helm-mu-contacts         |
| (C-M-c . mu4e-compose-mode-map) | helm-mu-contacts                       | helm-mu-contacts         |
| (c . mu4e-main-mode-map)        | helm-mu-contacts                       | helm-mu-contacts         |
| (s . mu4e-main-mode-map)        | helm-mu                                | helm-mu                  |
| (C-:)                           | helm-company                           | nil                      |
| (C-w)                           | spacemacs/backward-kill-word-or-region | kill-region              |
| (C-e)                           | mwim-end                               | move-end-of-line         |
| (C-a)                           | mwim-beginning                         | move-beginning-of-line   |
| (C-x C-U)                       | undo-tree-visualize                    | upcase-region            |
| (M-;)                           | comment-dwim-2                         | comment-dwim             |
| (C-k . org-mode-map)            | elib-kill-line-org-sp                  | nil                      |
| (C-c y x)                       | yas-expand                             | nil                      |
| (C-c y r)                       | yas-reload-all                         | nil                      |
| (C-c y m)                       | yas/minor-mode                         | nil                      |
| (C-c y g)                       | yas/global-mode                        | nil                      |
| (C-c y l)                       | yas-describe-tables                    | nil                      |
| (C-c y t)                       | yas-tryout-snippet                     | nil                      |
| (C-c y n)                       | yas-new-snippet                        | nil                      |
| (C-c y f)                       | yas-visit-snippet-file                 | nil                      |
| (C-c y i)                       | yas-insert-snippet                     | nil                      |
| (C-c y d)                       | yas-load-directory                     | nil                      |
| (<f10>)                         | helm-themes                            | menu-bar-open            |
| (M-n . minibuffer-local-map)    | helm-minibuffer-history                | next-history-element     |
| (M-p . minibuffer-local-map)    | helm-minibuffer-history                | previous-history-element |
| (C-h SPC)                       | helm-all-mark-rings                    | nil                      |
| (M-y)                           | helm-show-kill-ring                    | yank-pop                 |
| (<f9>)                          | eshell-here                            | nil                      |
| (<f7>)                          | nil                                    | nil                      |
| (<f8>)                          | nil                                    | org-caldav-sync          |
| (<f6>)                          | nil                                    | elib-open-calendar       |
| (<f12>)                         | nil                                    | mu4e                     |
| (C-h h)                         | nil                                    | view-hello-file          |

* Pdf tools
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
  :defer nil
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :config 

   (setq-default pdf-view-display-size 'fit-page)
   (setq  pdf-annot-activate-created-annotations t)
  ; (bind-key "C-s" isearch-forward pdf-view-mode-map)
   (setq pdf-view-resize-factor 1.1)
   (use-package pdf-annot
     :ensure nil
     )

   (use-package org-pdfview)

  <<general-pdf>>
  )
#+END_SRC 

#+RESULTS:
: ((\.pdf\' . pdf-view-mode) (\.hva\' . latex-mode) (\.drv\' . latex-mode) (/guix/drvs/[[:alnum:]]\{2\}/[[:alnum:]]\{30\}-\(?:[+._[:alnum:]-]+\)\.drv\' . guix-build-log-mode) (/gnu/store/\(?:[+._[:alnum:]-]+\)\.drv\' . guix-derivation-mode) (/etc/profile\' . guix-env-var-mode) (/tmp/guix-build-\(?:[+._[:alnum:]-]+\)\.drv-[[:digit:]]+/environment-variables\' . guix-env-var-mode) (/guix/profiles/system\(?:[+._[:alnum:]-]+\)*/\(?:boot\|parameters\)\' . guix-scheme-mode) (/gnu/store/\(?:[0-9a-df-np-sv-z]\{32\}\)-\(?:activate\|activate-service\|boot\|parameters\|shepherd\.conf\|shepherd\(?:[+._[:alnum:]-]+\)\.scm\|\(?:[+._[:alnum:]-]+\)-guile-builder\)\' . guix-scheme-mode) (\.rkt\' . scheme-mode) (\.md\' . markdown-mode) (\.markdown\' . markdown-mode) (/git-rebase-todo\' . git-rebase-mode) (\.gpg\(~\|\.~[0-9]+~\)?\' nil epa-file) (\.\(?:3fr\|a\(?:rw\|vs\)\|bmp[23]?\|c\(?:als?\|myka?\|r[2w]\|u[rt]\)\|d\(?:c[mrx]\|ds\|jvu\|ng\|px\)\|exr\|f\(?:ax\|its\)\|gif\(?:87\)?\|hrz\|ic\(?:on\|[bo]\)\|j\(?:2c\|ng\|p\(?:eg\|[2cg]\)\)\|k\(?:25\|dc\)\|m\(?:iff\|ng\|rw\|s\(?:l\|vg\)\|tv\)\|nef\|o\(?:rf\|tb\)\|p\(?:bm\|c\(?:ds\|[dltx]\)\|db\|ef\|gm\|i\(?:ct\|x\)\|jpeg\|n\(?:g\(?:24\|32\|8\)\|[gm]\)\|pm\|sd\|tif\|wp\)\|r\(?:a[fs]\|gb[ao]?\|l[ae]\)\|s\(?:c[rt]\|fw\|gi\|r[2f]\|un\|vgz?\)\|t\(?:ga\|i\(?:ff\(?:64\)?\|le\|m\)\|tf\)\|uyvy\|v\(?:da\|i\(?:car\|d\|ff\)\|st\)\|w\(?:bmp\|pg\)\|x\(?:3f\|bm\|cf\|pm\|wd\|[cv]\)\|y\(?:cbcra?\|uv\)\)\' . image-mode) (\.elc\' . elisp-byte-code-mode) (\.zst\' nil jka-compr) (\.dz\' nil jka-compr) (\.xz\' nil jka-compr) (\.lzma\' nil jka-compr) (\.lz\' nil jka-compr) (\.g?z\' nil jka-compr) (\.bz2\' nil jka-compr) (\.Z\' nil jka-compr) (\.vr[hi]?\' . vera-mode) (\(?:\.\(?:rbw?\|ru\|rake\|thor\|jbuilder\|rabl\|gemspec\|podspec\)\|/\(?:Gem\|Rake\|Cap\|Thor\|Puppet\|Berks\|Vagrant\|Guard\|Pod\)file\)\' . ruby-mode) (\.re?st\' . rst-mode) (\.py[iw]?\' . python-mode) (\.m\' . octave-maybe-mode) (\.less\' . less-css-mode) (\.scss\' . scss-mode) (\.awk\' . awk-mode) (\.\(u?lpc\|pike\|pmod\(\.in\)?\)\' . pike-mode) (\.idl\' . idl-mode) (\.java\' . java-mode) (\.m\' . objc-mode) (\.ii\' . c++-mode) (\.i\' . c-mode) (\.lex\' . c-mode) (\.y\(acc\)?\' . c-mode) (\.h\' . c-or-c++-mode) (\.c\' . c-mode) (\.\(CC?\|HH?\)\' . c++-mode) (\.[ch]\(pp\|xx\|\+\+\)\' . c++-mode) (\.\(cc\|hh\)\' . c++-mode) (\.\(bat\|cmd\)\' . bat-mode) (\.[sx]?html?\(\.[a-zA-Z_]+\)?\' . mhtml-mode) (\.svgz?\' . image-mode) (\.svgz?\' . xml-mode) (\.x[bp]m\' . image-mode) (\.x[bp]m\' . c-mode) (\.p[bpgn]m\' . image-mode) (\.tiff?\' . image-mode) (\.gif\' . image-mode) (\.png\' . image-mode) (\.jpe?g\' . image-mode) (\.te?xt\' . text-mode) (\.[tT]e[xX]\' . tex-mode) (\.ins\' . tex-mode) (\.ltx\' . latex-mode) (\.dtx\' . doctex-mode) (\.org\' . org-mode) (\.el\' . emacs-lisp-mode) (Project\.ede\' . emacs-lisp-mode) (\.\(scm\|stk\|ss\|sch\)\' . scheme-mode) (\.l\' . lisp-mode) (\.li?sp\' . lisp-mode) (\.[fF]\' . fortran-mode) (\.for\' . fortran-mode) (\.p\' . pascal-mode) (\.pas\' . pascal-mode) (\.\(dpr\|DPR\)\' . delphi-mode) (\.ad[abs]\' . ada-mode) (\.ad[bs].dg\' . ada-mode) (\.\([pP]\([Llm]\|erl\|od\)\|al\)\' . perl-mode) (Imakefile\' . makefile-imake-mode) (Makeppfile\(?:\.mk\)?\' . makefile-makepp-mode) (\.makepp\' . makefile-makepp-mode) (\.mk\' . makefile-gmake-mode) (\.make\' . makefile-gmake-mode) ([Mm]akefile\' . makefile-gmake-mode) (\.am\' . makefile-automake-mode) (\.texinfo\' . texinfo-mode) (\.te?xi\' . texinfo-mode) (\.[sS]\' . asm-mode) (\.asm\' . asm-mode) (\.css\' . css-mode) (\.mixal\' . mixal-mode) (\.gcov\' . compilation-mode) (/\.[a-z0-9-]*gdbinit . gdb-script-mode) (-gdb\.gdb . gdb-script-mode) ([cC]hange\.?[lL]og?\' . change-log-mode) ([cC]hange[lL]og[-.][0-9]+\' . change-log-mode) (\$CHANGE_LOG\$\.TXT . change-log-mode) (\.scm\.[0-9]*\' . scheme-mode) (\.[ckz]?sh\'\|\.shar\'\|/\.z?profile\' . sh-mode) (\.bash\' . sh-mode) (\(/\|\`\)\.\(bash_\(profile\|history\|log\(in\|out\)\)\|z?log\(in\|out\)\)\' . sh-mode) (\(/\|\`\)\.\(shrc\|zshrc\|m?kshrc\|bashrc\|t?cshrc\|esrc\)\' . sh-mode) (\(/\|\`\)\.\([kz]shenv\|xinitrc\|startxrc\|xsession\)\' . sh-mode) (\.m?spec\' . sh-mode) (\.m[mes]\' . nroff-mode) (\.man\' . nroff-mode) (\.sty\' . latex-mode) (\.cl[so]\' . latex-mode) (\.bbl\' . latex-mode) (\.bib\' . bibtex-mode) (\.bst\' . bibtex-style-mode) (\.sql\' . sql-mode) (\(acinclude\|aclocal\|acsite\)\.m4\' . autoconf-mode) (\.m[4c]\' . m4-mode) (\.mf\' . metafont-mode) (\.mp\' . metapost-mode) (\.vhdl?\' . vhdl-mode) (\.article\' . text-mode) (\.letter\' . text-mode) (\.i?tcl\' . tcl-mode) (\.exp\' . tcl-mode) (\.itk\' . tcl-mode) (\.icn\' . icon-mode) (\.sim\' . simula-mode) (\.mss\' . scribe-mode) (\.f9[05]\' . f90-mode) (\.f0[38]\' . f90-mode) (\.indent\.pro\' . fundamental-mode) (\.\(pro\|PRO\)\' . idlwave-mode) (\.srt\' . srecode-template-mode) (\.prolog\' . prolog-mode) (\.tar\' . tar-mode) (\.\(arc\|zip\|lzh\|lha\|zoo\|[jew]ar\|xpi\|rar\|cbr\|7z\|ARC\|ZIP\|LZH\|LHA\|ZOO\|[JEW]AR\|XPI\|RAR\|CBR\|7Z\)\' . archive-mode) (\.oxt\' . archive-mode) (\.\(deb\|[oi]pk\)\' . archive-mode) (\`/tmp/Re . text-mode) (/Message[0-9]*\' . text-mode) (\`/tmp/fol/ . text-mode) (\.oak\' . scheme-mode) (\.sgml?\' . sgml-mode) (\.x[ms]l\' . xml-mode) (\.dbk\' . xml-mode) (\.dtd\' . sgml-mode) (\.ds\(ss\)?l\' . dsssl-mode) (\.js[mx]?\' . javascript-mode) (\.har\' . javascript-mode) (\.json\' . javascript-mode) (\.[ds]?va?h?\' . verilog-mode) (\.by\' . bovine-grammar-mode) (\.wy\' . wisent-grammar-mode) ([:/\]\..*\(emacs\|gnus\|viper\)\' . emacs-lisp-mode) (\`\..*emacs\' . emacs-lisp-mode) ([:/]_emacs\' . emacs-lisp-mode) (/crontab\.X*[0-9]+\' . shell-script-mode) (\.ml\' . lisp-mode) (\.ld[si]?\' . ld-script-mode) (ld\.?script\' . ld-script-mode) (\.xs\' . c-mode) (\.x[abdsru]?[cnw]?\' . ld-script-mode) (\.zone\' . dns-mode) (\.soa\' . dns-mode) (\.asd\' . lisp-mode) (\.\(asn\|mib\|smi\)\' . snmp-mode) (\.\(as\|mi\|sm\)2\' . snmpv2-mode) (\.\(diffs?\|patch\|rej\)\' . diff-mode) (\.\(dif\|pat\)\' . diff-mode) (\.[eE]?[pP][sS]\' . ps-mode) (\.\(?:PDF\|DVI\|OD[FGPST]\|DOCX?\|XLSX?\|PPTX?\|pdf\|djvu\|dvi\|od[fgpst]\|docx?\|xlsx?\|pptx?\)\' . doc-view-mode-maybe) (configure\.\(ac\|in\)\' . autoconf-mode) (\.s\(v\|iv\|ieve\)\' . sieve-mode) (BROWSE\' . ebrowse-tree-mode) (\.ebrowse\' . ebrowse-tree-mode) (#\*mail\* . mail-mode) (\.g\' . antlr-mode) (\.mod\' . m2-mode) (\.ses\' . ses-mode) (\.docbook\' . sgml-mode) (\.com\' . dcl-mode) (/config\.\(?:bat\|log\)\' . fundamental-mode) (/\.\(authinfo\|netrc\)\' . authinfo-mode) (\.\(?:[iI][nN][iI]\|[lL][sS][tT]\|[rR][eE][gG]\|[sS][yY][sS]\)\' . conf-mode) (\.la\' . conf-unix-mode) (\.ppd\' . conf-ppd-mode) (java.+\.conf\' . conf-javaprop-mode) (\.properties\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-javaprop-mode) (\.toml\' . conf-toml-mode) (\.desktop\' . conf-desktop-mode) (\`/etc/\(?:DIR_COLORS\|ethers\|.?fstab\|.*hosts\|lesskey\|login\.?de\(?:fs\|vperm\)\|magic\|mtab\|pam\.d/.*\|permissions\(?:\.d/.+\)?\|protocols\|rpc\|services\)\' . conf-space-mode) (\`/etc/\(?:acpid?/.+\|aliases\(?:\.d/.+\)?\|default/.+\|group-?\|hosts\..+\|inittab\|ksysguarddrc\|opera6rc\|passwd-?\|shadow-?\|sysconfig/.+\)\' . conf-mode) ([cC]hange[lL]og[-.][-0-9a-z]+\' . change-log-mode) (/\.?\(?:gitconfig\|gnokiirc\|hgrc\|kde.*rc\|mime\.types\|wgetrc\)\' . conf-mode) (/\.\(?:enigma\|gltron\|gtk\|hxplayer\|net\|neverball\|qt/.+\|realplayer\|scummvm\|sversion\|sylpheed/.+\|xmp\)rc\' . conf-mode) (/\.\(?:gdbtkinit\|grip\|orbital/.+txt\|rhosts\|tuxracer/options\)\' . conf-mode) (/\.?X\(?:default\|resource\|re\)s\> . conf-xdefaults-mode) (/X11.+app-defaults/\|\.ad\' . conf-xdefaults-mode) (/X11.+locale/.+/Compose\' . conf-colon-mode) (/X11.+locale/compose\.dir\' . conf-javaprop-mode) (\.~?[0-9]+\.[0-9][-.0-9]*~?\' nil t) (\.\(?:orig\|in\|[bB][aA][kK]\)\' nil t) ([/.]c\(?:on\)?f\(?:i?g\)?\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-mode-maybe) (\.[1-9]\' . nroff-mode) (\.art\' . image-mode) (\.avs\' . image-mode) (\.bmp\' . image-mode) (\.cmyk\' . image-mode) (\.cmyka\' . image-mode) (\.crw\' . image-mode) (\.dcr\' . image-mode) (\.dcx\' . image-mode) (\.dng\' . image-mode) (\.dpx\' . image-mode) (\.fax\' . image-mode) (\.hrz\' . image-mode) (\.icb\' . image-mode) (\.icc\' . image-mode) (\.icm\' . image-mode) (\.ico\' . image-mode) (\.icon\' . image-mode) (\.jbg\' . image-mode) (\.jbig\' . image-mode) (\.jng\' . image-mode) (\.jnx\' . image-mode) (\.miff\' . image-mode) (\.mng\' . image-mode) (\.mvg\' . image-mode) (\.otb\' . image-mode) (\.p7\' . image-mode) (\.pcx\' . image-mode) (\.pdb\' . image-mode) (\.pfa\' . image-mode) (\.pfb\' . image-mode) (\.picon\' . image-mode) (\.pict\' . image-mode) (\.rgb\' . image-mode) (\.rgba\' . image-mode) (\.tga\' . image-mode) (\.wbmp\' . image-mode) (\.webp\' . image-mode) (\.wmf\' . image-mode) (\.wpg\' . image-mode) (\.xcf\' . image-mode) (\.xmp\' . image-mode) (\.xwd\' . image-mode) (\.yuv\' . image-mode) (\.tgz\' . tar-mode) (\.tbz2?\' . tar-mode) (\.txz\' . tar-mode) (\.tzst\' . tar-mode))


